mdmfile/src/Catalogs/мдмТочкиВыборВарианта/мдмТочкиВыборВарианта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мдмТочкиВыборВарианта</name>
  <owners>Catalog.мдмБизнесПроцессы</owners>
  <attributes>
    <name>ВыборВарианта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Входы</name>
    <attributes>
      <name>Точка</name>
      <type>
        <types>DefinedType.мдмТочкаБизнесПроцесса</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Выходы</name>
    <attributes>
      <name>Точка</name>
      <type>
        <types>DefinedType.мдмТочкаБизнесПроцесса</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Варианты</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

mdmfile/src/Catalogs/мдмТочкиБизнесПроцесса/мдмТочкиБизнесПроцесса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мдмТочкиБизнесПроцесса</name>
  <owners>Catalog.мдмБизнесПроцессы</owners>
  <attributes>
    <name>Точка</name>
    <type>
      <types>DefinedType.мдмТочкаБизнесПроцесса</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

mdmfile/src/Catalogs/мдмТочкиВыборВарианта/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытийФормы

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)

	мдмБизнесПроцессыСобытия.ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция ПолучитьПоИмени(Имя, БизнесПроцесс) Экспорт
	
	Возврат ЭтотОбъект().НайтиПоРеквизиту("Имя", Имя,, БизнесПроцесс);
	
КонецФункции

Функция СоздатьОбновитьТочки(Точка, Элемент, БизнесПроцесс) Экспорт
	
	Если ЗначениеЗаполнено(Точка) тогда
		Объект = Точка.ПолучитьОбъект();
	Иначе 
		Объект = Справочники.мдмТочкиВыборВарианта.СоздатьЭлемент();
		Объект.Владелец = БизнесПроцесс;
		Объект.УстановитьНовыйКод();
	КонецЕсли;	
	
	Объект.ПометкаУдаления = Ложь;
	Объект.Наименование = Элемент.Наименование;
	Объект.Имя = Элемент.Имя;
	
	Объект.Варианты.Очистить();
	Для Каждого Вариант из Элемент.Элементы цикл
		НовыйВариант = Объект.Варианты.Добавить();
		НовыйВариант.Имя = Вариант.Значение;
		НовыйВариант.Наименование = Вариант.Наименование;
	КонецЦикла;	
	
	Объект.ДополнительныеСвойства.Вставить("НеВыполнятьПроверкиЗаполнения");
	Объект.Записать();
	
	Точка = Объект.Ссылка;
	
	Возврат Объект.Ссылка;
	
КонецФункции	

Функция ОбновитьСвязиТочки(Точка, ТаблицаСвязей) Экспорт

	ТочкаОбъект = Точка.ПолучитьОбъект();
	
	ТочкаОбъект.Входы.Очистить();
	ТочкаОбъект.Выходы.Очистить();
	
	Для Каждого Связь из ТаблицаСвязей цикл
		
		Если Связь.Начало = Точка.Имя тогда
			
			ТекущаяТочка = Справочники.мдмТочкиБизнесПроцесса.ПолучитьПоИмени(Связь.Конец, Точка.Владелец);
			
			Если ЗначениеЗаполнено(ТекущаяТочка) тогда
				НоваяСтрока = ТочкаОбъект.Выходы.Добавить();
				НоваяСтрока.Точка = ТекущаяТочка.Точка;
				НоваяСтрока.Результат = Связь.НачалоВариант;
			КонецЕсли;
			
		ИначеЕсли Связь.Конец = Точка.Имя тогда	
			
			ТекущаяТочка = Справочники.мдмТочкиБизнесПроцесса.ПолучитьПоИмени(Связь.Начало, Точка.Владелец);
			
			Если ЗначениеЗаполнено(ТекущаяТочка) тогда
				НоваяСтрока = ТочкаОбъект.Входы.Добавить();
				НоваяСтрока.Точка = ТекущаяТочка.Точка;
			КонецЕсли;	
			
		КонецЕсли;	
		
	КонецЦикла;	
	
	ТочкаОбъект.ДополнительныеСвойства.Вставить("НеВыполнятьПроверкиЗаполнения");
	ТочкаОбъект.Записать();
	
	Возврат Точка;
	
КонецФункции	

Функция ЭтотОбъект() Экспорт
	
	Возврат Справочники.мдмТочкиВыборВарианта;
	
КонецФункции	

Функция ЕстьВходы() Экспорт
	Возврат Истина;
КонецФункции	

Функция ЕстьВыходы() Экспорт
	Возврат Истина;
КонецФункции	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
